# Дано: На вход подается строка N. Необходимо закодировать в словарь морзе


def print_morse_string() -> None:
    string: str = input("Введите строку: ")
    morse_dict: dict = {
        'А': '.-', 'Б': '-...', 'В': '.--', 'Г': '--.', 'Д': '-..', 'Е': '.', 'Ж': '...-', 'З': '--..', 'И': '..',
        'Й': '.---', 'К': '-.-', 'Л': '.-..', 'М': '--', 'Н': '-.', 'О': '---', 'П': '.--.',
        'Р': '.-.', 'С': '...', 'Т': '-', 'У': '..-', 'Ф': '..-.', 'Х': '....', 'Ц': '-.-.', 'Ч': '---.', 'Ш': '----',
        'Щ': '--.-', 'Ъ': '--.--', 'Ы': '-.--', 'Ь': '-..-', 'Э': '..-..', 'Ю': '..--', 'Я': '.-.-',
        '0': '-----', '1': '.----', '2': '..---', '3': '...--', '4': '....-', '5': '.....', '6': '-....', '7': '--...',
        '8': '---..', '9': '----.', '!': '-.--.', '?': '..--..','.': '.-.-.-', ',': '--..--'
    }

    for i in string:
        if morse_dict.get(i.upper()) is not None:
            print(morse_dict.get(i.upper()), end=' ')
        else:
            print("Ошибка ввода! Введите корректные значения(кириллица + символы от 0 до 9).")
            break
    print()

    return


class main:
    while True:
        print_morse_string()
