import math
"""
Домашнее Задание №_1
Вычислить глубину колодца, имея только камень и секундомер. 
Программа на вход получает любые данные, полученные в эксперименте и выдаёт результирующее значение в метрах
"""
G: float = 9.82

while True:
    time = input("Введите время падения камня: ")
    try: 
        t: float = float(time)
        h = (G*pow(t, 2))/2
        print("Глубина колодца равна %.2f м." % h)
    except ValueError:
        print("Системная ошибка, введите корректные данные!")


